# Chapter 7: **Operations** ðŸš€

In [1]:
import numpy as np 
import pandas as pd

**1) DataFrames Basic Operations**

In [2]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [3]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [4]:
df1.shape

(5, 3)

In [7]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [9]:
df1.info()

# this will give us the information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [ ]:
df1.describe()

# this will give us the statistical summary of the dataframe

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [11]:
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

**2) DataFrames Applying Functions**

In [12]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [13]:
def square(x):
    return x**2

In [16]:
df1['B'].apply(square)

#this will only change for temprorary period

0     100
1     400
2     900
3    1600
4    2500
Name: B, dtype: int64

In [17]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

---------------------------------------------------------------------
* **to change for permenant we will do :**

In [18]:
df1['B'] = df1['B'].apply(square)
df1['A'] = df1['A'].apply(lambda x: x*2)

In [19]:
df1

    A     B    C
0   2   100  100
1   4   400  200
2   6   900  300
3   8  1600  400
4  10  2500  500

In [20]:
df1['D'] = df1['A']*2

In [21]:
df1

    A     B    C   D
0   2   100  100   4
1   4   400  200   8
2   6   900  300  12
3   8  1600  400  16
4  10  2500  500  20